app/controllers/sessions_controller.rb

  def create
  begin
    user = User.authenticate(params[:email], params[:password])
  rescue Exception => e
  end

  if user
    session[:user_id] = user.id if User.where(:id => user.id).exists?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]